app/Controllers/AuthUsers.php

    public function index(){
        $auth_users = $this->auth_users_model->findAll();
---
SELECT *
FROM `auth_users`
WHERE `auth_users`.`deleted_at` IS NULL

    public function store(){
        $dados = $this->request->getVar();
        $this->auth_users_model->insert($dados);
---
INSERT INTO `auth_users` (`nome`, `created_at`, `updated_at`) VALUES ('cristiano', '2023-05-13 17:07:08', '2023-05-13 17:07:08')