app/Controllers/PesquisaPerguntas.php

    public function novo(){
        $perguntas = $this->pesquisa_perguntas_model->find();
---
SELECT *
FROM `pesquisa_perguntas`
WHERE `pesquisa_perguntas`.`deleted_at` IS NULL