app/Controllers/Pesquisas.php

    public function index(){
        $pesquisas = $this->pesquisas_model->findAll();
---
SELECT *
FROM `pesquisas`
WHERE `pesquisas`.`deleted_at` IS NULL