app/Models/PesquisasModel.php

    public function get_pesquisa_and_respostas($columns = ['*']){
        $this->select($columns)
        ->join('pesquisa_respostas', 'pesquisa_respostas.fk_pesquisa = pesquisas.id_pesquisa')
        ->join('auth_users', 'auth_users.id_user = pesquisa_respostas.fk_user');
        return $this->find();
---
SELECT `nome`, `resposta`, `fk_pesquisa`
FROM `pesquisas`
JOIN `pesquisa_respostas` ON `pesquisa_respostas`.`fk_pesquisa` = `pesquisas`.`id_pesquisa`
JOIN `auth_users` ON `auth_users`.`id_user` = `pesquisa_respostas`.`fk_user`
WHERE `pesquisas`.`deleted_at` IS NULL