app/Models/Pesquisa_PerguntasModel.php

    public function get_perguntas($columns = ['*']){
        $this->select($columns);
        return $this->find();
---
SELECT *
FROM `pesquisa_perguntas`
WHERE `pesquisa_perguntas`.`deleted_at` IS NULL